Repository: jonsaw/enterprise_app
Catalog: lib/l10n/app_*.arb
Languages: ms

source: Home
ms: Laman Utama

source: Profile
ms: Profil

source: Owner
ms: Pemilik

source: Manager
ms: Pengurus

source: User
ms: Pengguna

source: None
ms: Tiada

source: Overview
ms: Gambaran Keseluruhan

source: Sign Out
ms: Log Keluar

# signInTitle
source: Sign in to continue
ms: Log masuk untuk meneruskan

source: Enter verification code
ms: Masukkan kod pengesahan

source: Email
ms: E-mel

# emailHint
source: enter@example.com
ms: masuk@contoh.com

source: Password
ms: Kata Laluan

# passwordHint
source: Enter your password
ms: Masukkan kata laluan anda

source: Verification Code
ms: Kod Pengesahan

# verificationCodeHint
source: Enter the code sent to your email
ms: Masukkan kod yang dihantar ke e-mel anda

source: Continue
ms: Teruskan

source: Please wait...
ms: Sila tunggu...

# verifyAndSignIn
source: Verify & Sign In
ms: Sahkan & Log Masuk

source: Resend Code
ms: Hantar Semula Kod

source: Use Different Account
ms: Gunakan Akaun Lain

# enterEmailAndPassword
source: Please enter both email and password
ms: Sila masukkan e-mel dan kata laluan

# enterOtp
source: Please enter the OTP code
ms: Sila masukkan kod OTP

source: OTP resent successfully
ms: OTP telah dihantar semula

# homePageTitle
source: Home
ms: Laman Utama

# homePageContent
source: Content for Home will be implemented here.
ms: Kandungan untuk Laman Utama akan dilaksanakan di sini.

# profilePageTitle
source: Profile
ms: Profil

# profilePageContent
source: Content for Profile will be implemented here.
ms: Kandungan untuk Profil akan dilaksanakan di sini.

source: Session Management
ms: Pengurusan Sesi

# sessionManagementDescription
source: Sign out of session in this device
ms: Log keluar dari sesi di peranti ini

# signOutConfirmTitle
source: Sign Out
ms: Log Keluar

# signOutConfirmMessage
source: Are you sure you want to sign out?
ms: Adakah anda pasti mahu log keluar?

source: Cancel
ms: Batal

source: Delete
ms: Padam

source: Select Company
ms: Pilih Syarikat

source: Unknown Company
ms: Syarikat Tidak Diketahui

source: Users
ms: Pengguna-pengguna

source: Unknown User
ms: Pengguna Tidak Diketahui

source: User Details
ms: Butiran Pengguna

source: Search users...
ms: Cari pengguna...

source: Page
ms: Halaman

# ofPage
source: of
ms: daripada

source: Previous
ms: Sebelumnya

source: Next
ms: Seterusnya

source: No users found
ms: Tiada pengguna dijumpai

source: Error loading users
ms: Ralat memuatkan pengguna

source: Retry
ms: Cuba Lagi

source: User Information
ms: Maklumat Pengguna

source: Company Information
ms: Maklumat Syarikat

source: Name
ms: Nama

source: Role
ms: Peranan

source: User ID
ms: ID Pengguna

source: Company Name
ms: Nama Syarikat

source: Company Code
ms: Kod Syarikat

source: Company ID
ms: ID Syarikat

source: Created At
ms: Dicipta Pada

source: Updated At
ms: Dikemaskini Pada

source: Back to Users
ms: Kembali ke Pengguna

source: User not found
ms: Pengguna tidak dijumpai

# selectUserToViewDetails
source: Select a user to view details
ms: Pilih pengguna untuk melihat butiran

source: Access
ms: Akses

source: Invites
ms: Jemputan

source: Invite Details
ms: Butiran Jemputan

source: Create Invite
ms: Cipta Jemputan

source: Add
ms: Tambah

source: Search invites...
ms: Cari jemputan...

source: No invites found
ms: Tiada jemputan dijumpai

source: Error loading invites
ms: Ralat memuatkan jemputan

source: Invite Information
ms: Maklumat Jemputan

source: Token Information
ms: Maklumat Token

source: Creator Information
ms: Maklumat Pencipta

source: Invite Token
ms: Token Jemputan

source: Token Expires At
ms: Token Tamat Pada

source: Created By
ms: Dicipta Oleh

source: Pending
ms: Menunggu

source: Read
ms: Dibaca

source: Expired
ms: Tamat Tempoh

source: Read At
ms: Dibaca Pada

source: Invite ID
ms: ID Jemputan

source: Invite not found
ms: Jemputan tidak dijumpai

source: Back to Invites
ms: Kembali ke Jemputan

# selectInviteToViewDetails
source: Select an invite to view details
ms: Pilih jemputan untuk melihat butiran

source: Enter invitee name
ms: Masukkan nama jemputan

source: Enter invitee email
ms: Masukkan e-mel jemputan

source: Select role
ms: Pilih peranan

source: Invite created successfully
ms: Jemputan berjaya dicipta

source: Failed to create invite
ms: Gagal mencipta jemputan

source: Creating...
ms: Mencipta...

source: Copied to clipboard
ms: Disalin ke papan keratan

# emailRequired
source: Email is required
ms: E-mel diperlukan

# invalidEmail
source: Invalid email format
ms: Format e-mel tidak sah

# nameRequired
source: Name is required
ms: Nama diperlukan

# nameTooShort
source: Name must be at least 2 characters
ms: Nama mesti sekurang-kurangnya 2 aksara

# emailInvalid
source: Please enter a valid email address
ms: Sila masukkan alamat e-mel yang sah

source: Products
ms: Produk

source: Categories
ms: Kategori

source: Category
ms: Kategori

source: Category Details
ms: Butiran Kategori

source: Create Category
ms: Cipta Kategori

source: Edit Category
ms: Edit Kategori

source: Delete Category
ms: Padam Kategori

source: Search categories...
ms: Cari kategori...

source: No categories found
ms: Tiada kategori dijumpai

source: Error loading categories
ms: Ralat memuatkan kategori

# selectCategoryToViewDetails
source: Select a category to view details
ms: Pilih kategori untuk melihat butiran

source: Category not found
ms: Kategori tidak dijumpai

source: Back to Categories
ms: Kembali ke Kategori

source: Category Name
ms: Nama Kategori

# categoryDescription
source: Description
ms: Penerangan

source: Enter category name
ms: Masukkan nama kategori

# enterCategoryDescription
source: Enter description (optional)
ms: Masukkan penerangan (pilihan)

source: Category created successfully
ms: Kategori berjaya dicipta

source: Failed to create category
ms: Gagal mencipta kategori

source: Category updated successfully
ms: Kategori berjaya dikemaskini

source: Failed to update category
ms: Gagal mengemaskini kategori

source: Category deleted successfully
ms: Kategori berjaya dipadamkan

source: Failed to delete category
ms: Gagal memadam kategori

# deleteCategoryConfirmation
source: Are you sure you want to delete this category?
ms: Adakah anda pasti mahu memadam kategori ini?

# deleteCategoryWarning
source: This action cannot be undone.
ms: Tindakan ini tidak boleh dibatalkan.

source: Category Information
ms: Maklumat Kategori

source: Category ID
ms: ID Kategori

source: Revision
ms: Semakan

source: Unsaved Changes
ms: Perubahan Tidak Disimpan

# unsavedChangesMessage
source: You have unsaved changes. Are you sure you want to discard them?
ms: Anda mempunyai perubahan yang tidak disimpan. Adakah anda pasti untuk membuangnya?

source: Discard
ms: Buang

source: Updated By
ms: Dikemaskini Oleh

source: Update
ms: Kemaskini

source: Create
ms: Cipta

source: Types
ms: Jenis

source: Type
ms: Jenis

source: Type Details
ms: Butiran Jenis

source: Product Type Details
ms: Butiran Jenis Produk

source: Create Type
ms: Cipta Jenis

source: Edit Type
ms: Edit Jenis

source: Delete Type
ms: Padam Jenis

source: Search types...
ms: Cari jenis...

source: No types found
ms: Tiada jenis dijumpai

source: Error loading types
ms: Ralat memuatkan jenis

# selectTypeToViewDetails
source: Select a type to view details
ms: Pilih jenis untuk melihat butiran

source: Type not found
ms: Jenis tidak dijumpai

source: Back to Types
ms: Kembali ke Jenis

source: Type Name
ms: Nama Jenis

source: Type Description
ms: Penerangan Jenis

source: Type ID
ms: ID Jenis

source: Enter type name
ms: Masukkan nama jenis

# enterTypeDescription
source: Enter description (optional)
ms: Masukkan penerangan (pilihan)

source: Type created successfully
ms: Jenis berjaya dicipta

source: Failed to create type
ms: Gagal mencipta jenis

source: Type updated successfully
ms: Jenis berjaya dikemaskini

source: Failed to update type
ms: Gagal mengemaskini jenis

source: Type deleted successfully
ms: Jenis berjaya dipadamkan

source: Failed to delete type
ms: Gagal memadam jenis

# deleteTypeConfirmation
source: Are you sure you want to delete this type?
ms: Adakah anda pasti mahu memadam jenis ini?

# deleteTypeWarning
source: This action cannot be undone.
ms: Tindakan ini tidak boleh dibatalkan.

source: Type Information
ms: Maklumat Jenis

source: Details UI Schema
ms: Skema UI Butiran

source: Details UI Schema (JSON)
ms: Skema UI Butiran (JSON)

# enterDetailsUiSchema
source: Enter JSON schema for form fields
ms: Masukkan skema JSON untuk medan borang

# detailsUiSchemaRequired
source: Details UI schema is required
ms: Skema UI Butiran diperlukan

source: Invalid JSON
ms: JSON tidak sah

# jsonMustBeObject
source: JSON must be an object
ms: JSON mesti menjadi objek

# jsonMustContainRuntimeType
source: JSON must contain "runtimeType" field
ms: JSON mesti mengandungi medan "runtimeType"

source: Product Types
ms: Jenis Produk

# productsList
source: Products
ms: Produk

source: Product Details
ms: Butiran Produk

source: Create Product
ms: Cipta Produk

source: Edit Product
ms: Sunting Produk

source: Delete Product
ms: Padam Produk

source: Search products
ms: Cari produk

source: No products found
ms: Tiada produk ditemui

source: Error loading products
ms: Ralat memuatkan produk

# selectProductToViewDetails
source: Select a product to view details
ms: Pilih produk untuk melihat butiran

source: Product not found
ms: Produk tidak ditemui

source: Back to products
ms: Kembali ke produk

# productBrand
source: Brand
ms: Jenama

source: Enter product SKU
ms: Masukkan SKU produk

source: Enter product brand
ms: Masukkan jenama produk

source: Enter product model
ms: Masukkan model produk

# skuRequired
source: SKU is required
ms: SKU diperlukan

source: Affects Inventory
ms: Mempengaruhi Inventori

source: Product Information
ms: Maklumat Produk

source: Product ID
ms: ID Produk

source: Product created successfully
ms: Produk berjaya dicipta

source: Failed to create product
ms: Gagal mencipta produk

source: Product updated successfully
ms: Produk berjaya dikemas kini

source: Failed to update product
ms: Gagal mengemas kini produk

source: Product deleted successfully
ms: Produk berjaya dipadam

source: Failed to delete product
ms: Gagal memadam produk

# deleteProductConfirmation
source: Are you sure you want to delete this product?
ms: Adakah anda pasti mahu memadam produk ini?

# deleteProductWarning
source: This action cannot be undone.
ms: Tindakan ini tidak boleh dibuat asal.

source: Yes
ms: Ya

source: No
ms: Tidak
